{
    "TITLE": "Willkommen auf unserer Webseite",
    "DESCRIPTION": "Dies ist ein Beispiel für eine mehrsprachige Angular-App.",
    "BUTTON_TEXT": "Sprache ändern",    
    "ABOUTME": "Über mich",
    "IAM": "Ich bin",
    "LETS_TALK": "Lass uns reden",
    "SCROLL": "Scroll herunter",
    "MAPS": "Flexibel in Bezug auf Arbeitsumgebungen, kann ich sowohl vor Ort in Paderborn als auch remote effektiv arbeiten.",
    "PERSONALY_DESCRIPION":"Hallo, ich bin ein deutschsprachiger Frontend-Entwickler mit Wohnsitz in der Nähe von Paderborn. Angetrieben von den grenzenlosen Möglichkeiten in der IT freue ich mich darauf, visuell ansprechende und intuitive Websites sowie Anwendungen zu gestalten.",
    "BULB": "Ich bin aufgeschlossen und stets auf der Suche nach persönlichen Herausforderungen, um mein Wissen und meine Fähigkeiten kontinuierlich zu verbessern.",
    "PUZZLE": "In meinem Werdegang geht es beim Programmieren nicht nur um das Schreiben von Code; es ist eine kreative Form der Problemlösung. Ich bin stolz darauf, komplexe technische Herausforderungen in einfache, benutzerfreundliche Lösungen zu überführen. Auf diese Weise helfe ich Ihnen, Ihre Ziele zu erreichen und Ihre Visionen zum Leben zu erwecken.",
    "MY_SKILLS": "Meine Fähigkeiten",
    "EXPERIENCE": "Ich habe Erfahrung darin gesammelt, Projekte mit verschiedenen Frontend-Technologien und Konzepten zu realisieren.",
    "LOOKING_FOR": "Auf der Suche nach",
    "ANOTHER_SKILL": "weiteren Fähigkeit",
    "CONTACT_ME": "Kontaktieren Sie mich gerne. Ich freue mich darauf, mein bisheriges Wissen weiter auszubauen.",
    "BTN_CONTACT_ME": "Kontaktieren Sie mich",
    "JOIN": "Task-Manager, inspiriert vom Kanban-System. Erstelle und organisiere Aufgaben mithilfe von Drag-and-Drop-Funktionen, weise Benutzern und Kategorien zu.",
    "EL_POLLO_LOCO":"Ein Jump ’n’ Run Spiel basierend auf einem objektorientierten Ansatz. Hilf Pepe, Münzen und Tabasco-Salsa zu sammeln, um gegen die verrückte Henne zu kämpfen.",
    "POKEDEX": "Basierend auf der PokéAPI, eine einfache Bibliothek, die Pokémon-Informationen bereitstellt und katalogisiert.",
    "REFERENCE1": "Michael hat das Team mit seiner großartigen Organisation und seiner klaren Kommunikation wirklich zusammengehalten. Ohne sein Engagement wären wir nicht so weit gekommen.",
    "REFERENCE2":"Michi war ein erstklassiger Teamkollege bei DA. Sein positiver Einsatz und seine Bereitschaft, Verantwortung zu übernehmen, haben maßgeblich dazu beigetragen, dass wir unsere Ziele erreichen konnten.",
    "REFERENCE3":"Die Zusammenarbeit mit Michael war ein großes Vergnügen. Er weiß, wie man Teammitglieder dazu anregt und ermutigt, ihre bestmögliche Arbeit zu präsentieren, und bereichert stets das Brainstorming mit neuen Ideen. Was das Wohlbefinden der Gruppenmitglieder angeht, war er immer präsent, hörte zu und stand bereit, um zu helfen – und das alles mit einem großartigen Sinn für Humor.",
    "CONTACT": "Kontakt",
    "PROBLEM": "Haben Sie ein Problem zu lösen?",
    "CONTACT_ME_FORM": "Kontaktieren Sie mich über dieses Formular. Ich freue mich darauf, von Ihnen zu hören, Ihre Ideen kennenzulernen und mit meiner Arbeit zu Ihren Projekten beizutragen",
    "NEED_A_FRONTEND": "Brauchen Sie einen Frontend-Entwickler? Kontaktieren Sie mich!",
    "INPUT_NAME": "Dein Name",
    "INPUT_NAME_ERROR": "Ihr Name ist erforderlich",
    "INPUT_MAIL": "deine@mail.de",
    "INPUT_MAIL_ERROR": "Ihr Email ist erforderlich",    
    "INPUT_MESSAGE": "Deine Nachricht",
    "INPUT_MESSAGE_ERROR": "Ihre Nachricht muss mindestens 4 Zeichen umfassen",
    "I_HAVE_READ": "Ich habe die",
    "PRIVACY_POLIZY": "Datenschutzerklärung",
    "PRIVACY_POLIZY_END": "gelesen und stimme der Verarbeitung meiner Daten zu",
    "SEND_MESSAGE": "Nachricht senden",
    "LEGAL_NOTICE": "Impressum",
    "FORM_SUCCESS_MESSAGE": "Vielen Dank für Ihre Nachricht! Ich habe Ihre Anfrage erhalten und melde mich in Kürze bei Ihnen.",
    "PORTFOLIO_DESCRIPTION": "Entdecke hier eine Auswahl meiner Arbeiten – Interagiere mit den Projekten, um meine Fähigkeiten in Aktion zu erleben."    
  }
  