{
    "TITLE": "Welcome to our Website",
    "DESCRIPTION": "This is an example of a multilingual Angular app.",
    "BUTTON_TEXT": "Change Language",    
    "ABOUTME": "About me",
    "IAM": "I am",
    "LETS_TALK": "Let's talk",
    "SCROLL": "scroll down",
    "MAPS": "Flexible in terms of working environments, I can work effectively both on-site in Paderborn and remotely.",
    "PERSONALY_DESCRIPION" : "Hi, I'm a german speaking Frontend Developer based near Paderborn. Motivated by the limitles opportunities within IT, I am excited about crafting visually captivating and intuitive websites and application.",
    "BULB": "I am open-minded and always looking for personal challenges to constanly improve my knowledge and skills",
    "PUZZLE": "In my progession, programming isn't just about writing code; it's a creative form of problem-solving. I take pride in my ability to distill complex technical challenges into simple, user-friendly solutions. This way, I help you achieve your goals and bring your visions to life.",
    "MY_SKILLS": "My Skills",
    "EXPERIENCE": "I have gained experience in building projects with different frontend technologies and concepts.",
    "LOOKING_FOR": "Looking for",
    "ANOTHER_SKILL": "another skill",
    "CONTACT_ME": "Feel free to contact me. I look forward to expanding on my previous knowledge",
    "BTN_CONTACT_ME": "Get in touch",
    "JOIN": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories",
    "EL_POLLO_LOCO":"Jump, run  and throw game based on object-oriented approach. Help Pepe to fond coins and tabasco salsa to fight against the crazy hen.",
    "POKEDEX": "Based on the PokéAPI a simple library that provides and catalogues pokemin information.",
    "REFERENCE1":"Michael really kept the team together with his great organization and clear communication. We wouldn't have got this far without his commitment.",
    "REFERENCE2":"Michi was a top team colleague at DA. His positive commitment and willingness to take on responsibility made a significant contribution to us achieving our goals.",
    "REFERENCE3":"It was a great pleasure to work with Michael. He knows how to push and encourage team members to present the best work possible, always adding something to brainstorm. Regarding the well-being of group members, he was always present and available to listen and help others, with a great sense of humor as well.",
    "CONTACT": "Contact",
    "PROBLEM": "Got a problem to solve?",
    "CONTACT_ME_FORM": "Contact me through this form, I am interested in hearing from you, knowing your ideas and contributing to your projects with my work",
    "NEED_A_FRONTEND": "Need a frontend developer? Contact me?",
    "INPUT_NAME": "Your Name",
    "INPUT_NAME_ERROR": "Your Name is required",
    "INPUT_MAIL": "your@mail.com",
    "INPUT_MAIL_ERROR": "Your email is required",    
    "INPUT_MESSAGE": "Your message",
    "INPUT_MESSAGE_ERROR": " Your message must be at least 4 characters",
    "I_HAVE_READ": "I’ve read the",
    "PRIVACY_POLIZY": "privacy policy",
    "PRIVACY_POLIZY_END": "and agree to the processing of my data.",
    "SEND_MESSAGE": "Send message",
    "LEGAL_NOTICE": "Legal Notice",
    "FORM_SUCCESS_MESSAGE": "Thank you for reaching out! I have received your inquiry and will be in touch with you soon.",
    "PORTFOLIO_DESCRIPTION": "Explore a selection of my work here - Interact with projects to see my skills in action"
  }
  